tiborsimon/embedded-tdd-headers/pic/8bit/pic16f946_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F946_H_
#define _PIC16F946_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define RA6                           19
#define RA7                           20
#define PORTB                         21
#define RB0                           22
#define RB1                           23
#define RB2                           24
#define RB3                           25
#define RB4                           26
#define RB5                           27
#define RB6                           28
#define RB7                           29
#define PORTC                         30
#define RC0                           31
#define RC1                           32
#define RC2                           33
#define RC3                           34
#define RC4                           35
#define RC5                           36
#define RC6                           37
#define RC7                           38
#define PORTD                         39
#define RD0                           40
#define RD1                           41
#define RD2                           42
#define RD3                           43
#define RD4                           44
#define RD5                           45
#define RD6                           46
#define RD7                           47
#define PORTE                         48
#define RE0                           49
#define RE1                           50
#define RE2                           51
#define RE3                           52
#define RE4                           53
#define RE5                           54
#define RE6                           55
#define RE7                           56
#define INTCON                        57
#define RBIF                          58
#define INTF                          59
#define T0IF                          60
#define TMR0IF                        61
#define RBIE                          62
#define INTE                          63
#define T0IE                          64
#define TMR0IE                        65
#define PEIE                          66
#define GIE                           67
#define PIR1                          68
#define TMR1IF                        69
#define TMR2IF                        70
#define CCP1IF                        71
#define SSPIF                         72
#define TXIF                          73
#define RCIF                          74
#define ADIF                          75
#define EEIF                          76
#define PIR2                          77
#define CCP2IF                        78
#define LVDIF                         79
#define LCDIF                         80
#define C1IF                          81
#define C2IF                          82
#define OSFIF                         83
#define T1CON                         84
#define TMR1ON                        85
#define TMR1CS                        86
#define T1SYNC                        87
#define T1INSYNC                      88
#define nT1SYNC                       89
#define T1OSCEN                       90
#define T1CKPS0                       91
#define T1CKPS                        92
#define T1CKPS1                       93
#define T1GE                          94
#define TMR1GE                        95
#define T1GINV                        96
#define T2CON                         97
#define T2CKPS0                       98
#define T2CKPS                        99
#define T2CKPS1                       100
#define TMR2ON                        101
#define TOUTPS0                       102
#define TOUTPS                        103
#define TOUTPS1                       104
#define TOUTPS2                       105
#define TOUTPS3                       106
#define SSPCON                        107
#define SSPM0                         108
#define SSPM                          109
#define SSPM1                         110
#define SSPM2                         111
#define SSPM3                         112
#define CKP                           113
#define SSPEN                         114
#define SSPOV                         115
#define WCOL                          116
#define CCP1CON                       117
#define CCP1M0                        118
#define CCP1M                         119
#define CCP1M1                        120
#define CCP1M2                        121
#define CCP1M3                        122
#define CCP1Y                         123
#define CCP1X                         124
#define RCSTA                         125
#define RCD8                          126
#define RX9D                          127
#define OERR                          128
#define FERR                          129
#define ADDEN                         130
#define CREN                          131
#define SREN                          132
#define RC8_9                         133
#define RC9                           134
#define RX9                           135
#define nRC8                          136
#define SPEN                          137
#define CCP2CON                       138
#define CCP2M                         139
#define CCP2M0                        140
#define CCP2M1                        141
#define CCP2M2                        142
#define CCP2M3                        143
#define CCP2Y                         144
#define CCP2X                         145
#define ADCON0                        146
#define ADON                          147
#define nDONE                         148
#define GO_nDONE                      149
#define GO_DONE                       150
#define GO                            151
#define CHS                           152
#define CHS0                          153
#define CHS1                          154
#define CHS2                          155
#define VCFG                          156
#define VCFG0                         157
#define VCFG1                         158
#define ADFM                          159
#define OPTION_REG                    160
#define PS                            161
#define PS0                           162
#define PS1                           163
#define PS2                           164
#define PSA                           165
#define T0SE                          166
#define T0CS                          167
#define INTEDG                        168
#define nRBPU                         169
#define TRISA                         170
#define TRISA0                        171
#define TRISA1                        172
#define TRISA2                        173
#define TRISA3                        174
#define TRISA4                        175
#define TRISA5                        176
#define TRISA6                        177
#define TRISA7                        178
#define TRISB                         179
#define TRISB0                        180
#define TRISB1                        181
#define TRISB2                        182
#define TRISB3                        183
#define TRISB4                        184
#define TRISB5                        185
#define TRISB6                        186
#define TRISB7                        187
#define TRISC                         188
#define TRISC0                        189
#define TRISC1                        190
#define TRISC2                        191
#define TRISC3                        192
#define TRISC4                        193
#define TRISC5                        194
#define TRISC6                        195
#define TRISC7                        196
#define TRISD                         197
#define TRISD0                        198
#define TRISD1                        199
#define TRISD2                        200
#define TRISD3                        201
#define TRISD4                        202
#define TRISD5                        203
#define TRISD6                        204
#define TRISD7                        205
#define TRISE                         206
#define TRISE0                        207
#define TRISE1                        208
#define TRISE2                        209
#define TRISE3                        210
#define TRISE4                        211
#define TRISE5                        212
#define TRISE6                        213
#define TRISE7                        214
#define PIE1                          215
#define TMR1IE                        216
#define TMR2IE                        217
#define CCP1IE                        218
#define SSPIE                         219
#define TXIE                          220
#define RCIE                          221
#define ADIE                          222
#define EEIE                          223
#define PIE2                          224
#define CCP2IE                        225
#define LVDIE                         226
#define LCDIE                         227
#define C1IE                          228
#define C2IE                          229
#define OSFIE                         230
#define PCON                          231
#define nBOR                          232
#define nBO                           233
#define nPOR                          234
#define SBOREN                        235
#define OSCCON                        236
#define SCS                           237
#define LTS                           238
#define HTS                           239
#define OSTS                          240
#define IRCF                          241
#define IRCF0                         242
#define IRCF1                         243
#define IRCF2                         244
#define OSCTUNE                       245
#define TUN0                          246
#define TUN                           247
#define TUN1                          248
#define TUN2                          249
#define TUN3                          250
#define TUN4                          251
#define ANSEL                         252
#define ANS0                          253
#define AN                            254
#define AN0                           255
#define ANS1                          256
#define AN1                           257
#define ANS2                          258
#define AN2                           259
#define ANS3                          260
#define AN3                           261
#define ANS4                          262
#define AN4                           263
#define ANS5                          264
#define AN5                           265
#define ANS6                          266
#define AN6                           267
#define AN7                           268
#define ANS7                          269
#define SSPSTAT                       270
#define BF                            271
#define UA                            272
#define R_nW                          273
#define READ_WRITE                    274
#define I2C_READ                      275
#define nW                            276
#define R                             277
#define nWRITE                        278
#define R_W                           279
#define S                             280
#define I2C_START                     281
#define I2C_STOP                      282
#define P                             283
#define nA                            284
#define D_A                           285
#define D_nA                          286
#define D                             287
#define DATA_ADDRESS                  288
#define nADDRESS                      289
#define I2C_DATA                      290
#define CKE                           291
#define SMP                           292
#define WPUB0                         293
#define WPU0                          294
#define WPUB                          295
#define WPUB1                         296
#define WPU1                          297
#define WPUB2                         298
#define WPU2                          299
#define WPUB3                         300
#define WPU3                          301
#define WPUB4                         302
#define WPU4                          303
#define WPUB5                         304
#define WPU5                          305
#define WPUB6                         306
#define WPU6                          307
#define WPUB7                         308
#define WPU7                          309
#define IOCB4                         310
#define IOC4                          311
#define IOCB                          312
#define IOC5                          313
#define IOCB5                         314
#define IOC6                          315
#define IOCB6                         316
#define IOC7                          317
#define IOCB7                         318
#define CMCON1                        319
#define C2SYNC                        320
#define T1GSS                         321
#define TXSTA                         322
#define TXD8                          323
#define TX9D                          324
#define TRMT                          325
#define BRGH                          326
#define SYNC                          327
#define TXEN                          328
#define TX8_9                         329
#define TX9                           330
#define nTX8                          331
#define CSRC                          332
#define CMCON0                        333
#define CM                            334
#define CM0                           335
#define CM1                           336
#define CM2                           337
#define CIS                           338
#define C1INV                         339
#define C2INV                         340
#define C1OUT                         341
#define C2OUT                         342
#define VRCON                         343
#define VR0                           344
#define VR                            345
#define VR1                           346
#define VR2                           347
#define VR3                           348
#define VRR                           349
#define VREN                          350
#define ADCON1                        351
#define ADCS                          352
#define ADCS0                         353
#define ADCS1                         354
#define ADCS2                         355
#define WDTCON                        356
#define SWDTEN                        357
#define SWDTE                         358
#define WDTPS                         359
#define WDTPS0                        360
#define WDTPS1                        361
#define WDTPS2                        362
#define WDTPS3                        363
#define LCDCON                        364
#define LMUX0                         365
#define LMUX                          366
#define LMUX1                         367
#define CS                            368
#define CS0                           369
#define CS1                           370
#define VLCDEN                        371
#define WERR                          372
#define SLPEN                         373
#define LCDEN                         374
#define LCDPS                         375
#define LP                            376
#define LP0                           377
#define LP1                           378
#define LP2                           379
#define LP3                           380
#define WA                            381
#define LCDA                          382
#define BIASMD                        383
#define WFT                           384
#define LVDCON                        385
#define LVDL0                         386
#define LVDL                          387
#define LVDL1                         388
#define LVDL2                         389
#define LVDEN                         390
#define IRVST                         391
#define EEDATL                        392
#define EEDATL0                       393
#define EEDATL1                       394
#define EEDATL2                       395
#define EEDATL3                       396
#define EEDATL4                       397
#define EEDATL5                       398
#define EEDATL6                       399
#define EEDATL7                       400
#define EEADRL                        401
#define EEADRL0                       402
#define EEADRL1                       403
#define EEADRL2                       404
#define EEADRL3                       405
#define EEADRL4                       406
#define EEADRL5                       407
#define EEADRL6                       408
#define EEADRL7                       409
#define EEDATH                        410
#define EEDATH0                       411
#define EEDATH1                       412
#define EEDATH2                       413
#define EEDATH3                       414
#define EEDATH4                       415
#define EEDATH5                       416
#define EEADRH                        417
#define EEADRH0                       418
#define EEADRH1                       419
#define EEADRH2                       420
#define EEADRH3                       421
#define EEADRH4                       422
#define LCDDATA0                      423
#define SEG0COM0                      424
#define LCDDATA0_SEG0                 425
#define S0C0                          426
#define LCDDATA0_SEG1                 427
#define SEG1COM0                      428
#define S1C0                          429
#define LCDDATA0_SEG2                 430
#define S2C0                          431
#define SEG2COM0                      432
#define SEG3COM0                      433
#define LCDDATA0_SEG3                 434
#define S3C0                          435
#define LCDDATA0_SEG4                 436
#define SEG4COM0                      437
#define S4C0                          438
#define LCDDATA0_SEG5                 439
#define S5C0                          440
#define SEG5COM0                      441
#define SEG6COM0                      442
#define LCDDATA0_SEG6                 443
#define S6C0                          444
#define SEG7COM0                      445
#define LCDDATA0_SEG7                 446
#define S7C0                          447
#define LCDDATA1                      448
#define LCDDATA1_SEG8                 449
#define S8C0                          450
#define SEG8COM0                      451
#define LCDDATA1_SEG9                 452
#define S9C0                          453
#define SEG9COM0                      454
#define LCDDATA1_SEG10                455
#define SEG10COM0                     456
#define S10C0                         457
#define LCDDATA1_SEG11                458
#define S11C0                         459
#define SEG11COM0                     460
#define LCDDATA1_SEG12                461
#define S12C0                         462
#define SEG12COM0                     463
#define S13C0                         464
#define LCDDATA1_SEG13                465
#define SEG13COM0                     466
#define S14C0                         467
#define LCDDATA1_SEG14                468
#define SEG14COM0                     469
#define SEG15COM0                     470
#define LCDDATA1_SEG15                471
#define S15C0                         472
#define LCDDATA2                      473
#define S16C0                         474
#define SEG16COM0                     475
#define LCDDATA2_SEG16                476
#define S17C0                         477
#define LCDDATA2_SEG17                478
#define SEG17COM0                     479
#define S18C0                         480
#define SEG18COM0                     481
#define LCDDATA2_SEG18                482
#define S19C0                         483
#define SEG19COM0                     484
#define LCDDATA2_SEG19                485
#define LCDDATA2_SEG20                486
#define S20C0                         487
#define SEG20COM0                     488
#define LCDDATA2_SEG21                489
#define S21C0                         490
#define SEG21COM0                     491
#define LCDDATA2_SEG22                492
#define SEG22COM0                     493
#define S22C0                         494
#define LCDDATA2_SEG23                495
#define SEG23COM0                     496
#define S23C0                         497
#define LCDDATA3                      498
#define SEG0COM1                      499
#define LCDDATA3_SEG0                 500
#define S0C1                          501
#define LCDDATA3_SEG1                 502
#define SEG1COM1                      503
#define S1C1                          504
#define LCDDATA3_SEG2                 505
#define S2C1                          506
#define SEG2COM1                      507
#define SEG3COM1                      508
#define LCDDATA3_SEG3                 509
#define S3C1                          510
#define SEG4COM1                      511
#define LCDDATA3_SEG4                 512
#define S4C1                          513
#define LCDDATA3_SEG5                 514
#define S5C1                          515
#define SEG5COM1                      516
#define LCDDATA3_SEG6                 517
#define SEG6COM1                      518
#define S6C1                          519
#define LCDDATA3_SEG7                 520
#define SEG7COM1                      521
