tiborsimon/embedded-tdd-headers/pic/8bit/pic16f946_tdd.h
#define S7C1                          522
#define LCDDATA4                      523
#define S8C1                          524
#define SEG8COM1                      525
#define LCDDATA4_SEG8                 526
#define S9C1                          527
#define SEG9COM1                      528
#define LCDDATA4_SEG9                 529
#define LCDDATA4_SEG10                530
#define SEG10COM1                     531
#define S10C1                         532
#define LCDDATA4_SEG11                533
#define S11C1                         534
#define SEG11COM1                     535
#define LCDDATA4_SEG12                536
#define S12C1                         537
#define SEG12COM1                     538
#define S13C1                         539
#define LCDDATA4_SEG13                540
#define SEG13COM1                     541
#define S14C1                         542
#define LCDDATA4_SEG14                543
#define SEG14COM1                     544
#define SEG15COM1                     545
#define S15C1                         546
#define LCDDATA4_SEG15                547
#define LCDDATA5                      548
#define SEG16COM1                     549
#define S16C1                         550
#define LCDDATA5_SEG16                551
#define S17C1                         552
#define LCDDATA5_SEG17                553
#define SEG17COM1                     554
#define S18C1                         555
#define SEG18COM1                     556
#define LCDDATA5_SEG18                557
#define S19C1                         558
#define SEG19COM1                     559
#define LCDDATA5_SEG19                560
#define LCDDATA5_SEG20                561
#define S20C1                         562
#define SEG20COM1                     563
#define LCDDATA5_SEG21                564
#define S21C1                         565
#define SEG21COM1                     566
#define LCDDATA5_SEG22                567
#define SEG22COM1                     568
#define S22C1                         569
#define LCDDATA5_SEG23                570
#define SEG23COM1                     571
#define S23C1                         572
#define LCDDATA6                      573
#define SEG0COM2                      574
#define LCDDATA6_SEG0                 575
#define S0C2                          576
#define LCDDATA6_SEG1                 577
#define SEG1COM2                      578
#define S1C2                          579
#define LCDDATA6_SEG2                 580
#define S2C2                          581
#define SEG2COM2                      582
#define SEG3COM2                      583
#define LCDDATA6_SEG3                 584
#define S3C2                          585
#define SEG4COM2                      586
#define LCDDATA6_SEG4                 587
#define S4C2                          588
#define S5C2                          589
#define LCDDATA6_SEG5                 590
#define SEG5COM2                      591
#define SEG6COM2                      592
#define S6C2                          593
#define LCDDATA6_SEG6                 594
#define SEG7COM2                      595
#define LCDDATA6_SEG7                 596
#define S7C2                          597
#define LCDDATA7                      598
#define LCDDATA7_SEG8                 599
#define S8C2                          600
#define SEG8COM2                      601
#define S9C2                          602
#define SEG9COM2                      603
#define LCDDATA7_SEG9                 604
#define SEG10COM2                     605
#define S10C2                         606
#define LCDDATA7_SEG10                607
#define S11C2                         608
#define LCDDATA7_SEG11                609
#define SEG11COM2                     610
#define S12C2                         611
#define LCDDATA7_SEG12                612
#define SEG12COM2                     613
#define S13C2                         614
#define SEG13COM2                     615
#define LCDDATA7_SEG13                616
#define S14C2                         617
#define SEG14COM2                     618
#define LCDDATA7_SEG14                619
#define SEG15COM2                     620
#define S15C2                         621
#define LCDDATA7_SEG15                622
#define LCDDATA8                      623
#define SEG16COM2                     624
#define S16C2                         625
#define LCDDATA8_SEG16                626
#define S17C2                         627
#define LCDDATA8_SEG17                628
#define SEG17COM2                     629
#define S18C2                         630
#define SEG18COM2                     631
#define LCDDATA8_SEG18                632
#define S19C2                         633
#define SEG19COM2                     634
#define LCDDATA8_SEG19                635
#define LCDDATA8_SEG20                636
#define S20C2                         637
#define SEG20COM2                     638
#define LCDDATA8_SEG21                639
#define S21C2                         640
#define SEG21COM2                     641
#define LCDDATA8_SEG22                642
#define SEG22COM2                     643
#define S22C2                         644
#define SEG23COM2                     645
#define LCDDATA8_SEG23                646
#define S23C2                         647
#define LCDDATA9                      648
#define SEG0COM3                      649
#define LCDDATA9_SEG0                 650
#define S0C3                          651
#define SEG1COM3                      652
#define S1C3                          653
#define LCDDATA9_SEG1                 654
#define S2C3                          655
#define LCDDATA9_SEG2                 656
#define SEG2COM3                      657
#define SEG3COM3                      658
#define S3C3                          659
#define LCDDATA9_SEG3                 660
#define SEG4COM3                      661
#define LCDDATA9_SEG4                 662
#define S4C3                          663
#define S5C3                          664
#define SEG5COM3                      665
#define LCDDATA9_SEG5                 666
#define SEG6COM3                      667
#define S6C3                          668
#define LCDDATA9_SEG6                 669
#define SEG7COM3                      670
#define S7C3                          671
#define LCDDATA9_SEG7                 672
#define LCDDATA10                     673
#define S8C3                          674
#define SEG8COM3                      675
#define LCDDATA10_SEG8                676
#define S9C3                          677
#define SEG9COM3                      678
#define LCDDATA10_SEG9                679
#define SEG10COM3                     680
#define S10C3                         681
#define LCDDATA10_SEG10               682
#define S11C3                         683
#define LCDDATA10_SEG11               684
#define SEG11COM3                     685
#define S12C3                         686
#define LCDDATA10_SEG12               687
#define SEG12COM3                     688
#define S13C3                         689
#define SEG13COM3                     690
#define LCDDATA10_SEG13               691
#define S14C3                         692
#define SEG14COM3                     693
#define LCDDATA10_SEG14               694
#define SEG15COM3                     695
#define S15C3                         696
#define LCDDATA10_SEG15               697
#define LCDDATA11                     698
#define SEG16COM3                     699
#define S16C3                         700
#define LCDDATA11_SEG16               701
#define S17C3                         702
#define LCDDATA11_SEG17               703
#define SEG17COM3                     704
#define S18C3                         705
#define SEG18COM3                     706
#define LCDDATA11_SEG18               707
#define LCDDATA11_SEG19               708
#define S19C3                         709
#define SEG19COM3                     710
#define LCDDATA11_SEG20               711
#define S20C3                         712
#define SEG20COM3                     713
#define LCDDATA11_SEG21               714
#define S21C3                         715
#define SEG21COM3                     716
#define LCDDATA11_SEG22               717
#define SEG22COM3                     718
#define S22C3                         719
#define LCDDATA11_SEG23               720
#define SEG23COM3                     721
#define S23C3                         722
#define LCDSE0                        723
#define LCDSE0_SEG0                   724
#define SE0                           725
#define SEGEN0                        726
#define LCDSE0_SEG1                   727
#define SE1                           728
#define SEGEN1                        729
#define LCDSE0_SEG2                   730
#define SE2                           731
#define SEGEN2                        732
#define LCDSE0_SEG3                   733
#define SE3                           734
#define SEGEN3                        735
#define LCDSE0_SEG4                   736
#define SE4                           737
#define SEGEN4                        738
#define LCDSE0_SEG5                   739
#define SE5                           740
#define SEGEN5                        741
#define LCDSE0_SEG6                   742
#define SE6                           743
#define SEGEN6                        744
#define LCDSE0_SEG7                   745
#define SE7                           746
#define SEGEN7                        747
#define LCDSE1                        748
#define LCDSE1_SEG8                   749
#define SE8                           750
#define SEGEN8                        751
#define LCDSE1_SEG9                   752
#define SE9                           753
#define SEGEN9                        754
#define SEGEN10                       755
#define LCDSE1_SEG10                  756
#define SE10                          757
#define SEGEN11                       758
#define SE11                          759
#define LCDSE1_SEG11                  760
#define SEGEN12                       761
#define SE12                          762
#define LCDSE1_SEG12                  763
#define SEGEN13                       764
#define SE13                          765
#define LCDSE1_SEG13                  766
#define SE14                          767
#define SEGEN14                       768
#define LCDSE1_SEG14                  769
#define SE15                          770
#define SEGEN15                       771
#define LCDSE1_SEG15                  772
#define LCDSE2                        773
#define SEGEN16                       774
#define SE16                          775
#define LCDSE2_SEG16                  776
#define SEGEN17                       777
#define SE17                          778
#define LCDSE2_SEG17                  779
#define SEGEN18                       780
#define SE18                          781
#define LCDSE2_SEG18                  782
#define SEGEN19                       783
#define SE19                          784
#define LCDSE2_SEG19                  785
#define LCDSE2_SEG20                  786
#define SEGEN20                       787
#define SE20                          788
#define LCDSE2_SEG21                  789
#define SEGEN21                       790
#define SE21                          791
#define LCDSE2_SEG22                  792
#define SEGEN22                       793
#define SE22                          794
#define LCDSE2_SEG23                  795
#define SEGEN23                       796
#define SE23                          797
#define TRISF                         798
#define TRISF0                        799
#define TRISF1                        800
#define TRISF2                        801
#define TRISF3                        802
#define TRISF4                        803
#define TRISF5                        804
#define TRISF6                        805
#define TRISF7                        806
#define TRISG                         807
#define TRISG0                        808
#define TRISG1                        809
#define TRISG2                        810
#define TRISG3                        811
#define TRISG4                        812
#define TRISG5                        813
#define PORTF                         814
#define RF0                           815
#define RF1                           816
#define RF2                           817
#define RF3                           818
#define RF4                           819
#define RF5                           820
#define RF6                           821
#define RF7                           822
#define PORTG                         823
#define RG0                           824
#define RG1                           825
#define RG2                           826
#define RG3                           827
#define RG4                           828
#define RG5                           829
#define EECON1                        830
#define EERD                          831
#define RD                            832
#define EEWR                          833
#define WR                            834
#define WREN                          835
#define WRERR                         836
#define EEPGD                         837
#define LCDDATA12                     838
#define S24C0                         839
#define SEG24COM0                     840
#define LCDDATA12_SEG24               841
#define SEG25COM0                     842
#define S25C0                         843
#define LCDDATA12_SEG25               844
#define SEG26COM0                     845
#define S26C0                         846
#define LCDDATA12_SEG26               847
#define SEG27COM0                     848
#define S27C0                         849
#define LCDDATA12_SEG27               850
#define S28C0                         851
#define SEG28COM0                     852
#define LCDDATA12_SEG28               853
#define SEG29COM0                     854
#define S29C0                         855
#define LCDDATA12_SEG29               856
#define SEG30COM0                     857
#define S30C0                         858
#define LCDDATA12_SEG30               859
#define LCDDATA12_SEG31               860
#define S31C0                         861
#define SEG31COM0                     862
#define LCDDATA13                     863
#define LCDDATA13_SEG32               864
#define S32C0                         865
#define SEG32COM0                     866
#define SEG33COM0                     867
#define LCDDATA13_SEG33               868
#define S33C0                         869
#define LCDDATA13_SEG34               870
#define S34C0                         871
#define SEG34COM0                     872
#define LCDDATA13_SEG35               873
#define S35C0                         874
#define SEG35COM0                     875
#define LCDDATA13_SEG36               876
#define SEG36COM0                     877
#define S36C0                         878
#define LCDDATA13_SEG37               879
#define S37C0                         880
#define SEG37COM0                     881
#define LCDDATA13_SEG38               882
#define SEG38COM0                     883
#define S38C0                         884
#define LCDDATA13_SEG39               885
#define SEG39COM0                     886
#define S39C0                         887
#define LCDDATA14                     888
#define S40C0                         889
#define LCDDATA14_SEG40               890
#define SEG40COM0                     891
#define SEG41COM0                     892
#define LCDDATA14_SEG41               893
#define S41C0                         894
#define LCDDATA15                     895
#define S24C1                         896
#define SEG24COM1                     897
#define LCDDATA15_SEG24               898
#define SEG25COM1                     899
#define LCDDATA15_SEG25               900
#define S25C1                         901
#define SEG26COM1                     902
#define S26C1                         903
#define LCDDATA15_SEG26               904
#define SEG27COM1                     905
#define S27C1                         906
#define LCDDATA15_SEG27               907
#define LCDDATA15_SEG28               908
#define SEG28COM1                     909
#define S28C1                         910
#define SEG29COM1                     911
#define S29C1                         912
#define LCDDATA15_SEG29               913
#define SEG30COM1                     914
#define S30C1                         915
#define LCDDATA15_SEG30               916
#define S31C1                         917
#define LCDDATA15_SEG31               918
#define SEG31COM1                     919
#define LCDDATA16                     920
#define S32C1                         921
#define SEG32COM1                     922
#define LCDDATA16_SEG32               923
#define SEG33COM1                     924
#define S33C1                         925
#define LCDDATA16_SEG33               926
#define S34C1                         927
#define LCDDATA16_SEG34               928
#define SEG34COM1                     929
#define S35C1                         930
#define SEG35COM1                     931
#define LCDDATA16_SEG35               932
#define SEG36COM1                     933
#define S36C1                         934
#define LCDDATA16_SEG36               935
#define S37C1                         936
#define LCDDATA16_SEG37               937
#define SEG37COM1                     938
#define SEG38COM1                     939
#define S38C1                         940
#define LCDDATA16_SEG38               941
#define SEG39COM1                     942
#define S39C1                         943
#define LCDDATA16_SEG39               944
#define LCDDATA17                     945
#define S40C1                         946
#define LCDDATA17_SEG40               947
#define SEG40COM1                     948
#define SEG41COM1                     949
#define LCDDATA17_SEG41               950
#define S41C1                         951
#define LCDDATA18                     952
#define S24C2                         953
#define SEG24COM2                     954
#define LCDDATA18_SEG24               955
#define SEG25COM2                     956
#define S25C2                         957
#define LCDDATA18_SEG25               958
#define SEG26COM2                     959
#define S26C2                         960
#define LCDDATA18_SEG26               961
#define SEG27COM2                     962
#define S27C2                         963
#define LCDDATA18_SEG27               964
#define S28C2                         965
#define SEG28COM2                     966
#define LCDDATA18_SEG28               967
#define SEG29COM2                     968
#define S29C2                         969
#define LCDDATA18_SEG29               970
#define SEG30COM2                     971
#define S30C2                         972
#define LCDDATA18_SEG30               973
#define S31C2                         974
#define LCDDATA18_SEG31               975
#define SEG31COM2                     976
#define LCDDATA19                     977
#define S32C2                         978
#define LCDDATA19_SEG32               979
#define SEG32COM2                     980
#define SEG33COM2                     981
#define S33C2                         982
#define LCDDATA19_SEG33               983
#define LCDDATA19_SEG34               984
#define S34C2                         985
#define SEG34COM2                     986
#define LCDDATA19_SEG35               987
#define S35C2                         988
#define SEG35COM2                     989
#define LCDDATA19_SEG36               990
#define SEG36COM2                     991
#define S36C2                         992
#define LCDDATA19_SEG37               993
#define S37C2                         994
#define SEG37COM2                     995
#define LCDDATA19_SEG38               996
#define SEG38COM2                     997
#define S38C2                         998
#define LCDDATA19_SEG39               999
#define SEG39COM2                     1000
#define S39C2                         1001
#define LCDDATA20                     1002
#define S40C2                         1003
#define SEG40COM2                     1004
#define LCDDATA20_SEG40               1005
#define SEG41COM2                     1006
#define S41C2                         1007
#define LCDDATA20_SEG41               1008
#define LCDDATA21                     1009
#define S24C3                         1010
#define SEG24COM3                     1011
#define LCDDATA21_SEG24               1012
#define SEG25COM3                     1013
#define S25C3                         1014
#define LCDDATA21_SEG25               1015
#define SEG26COM3                     1016
#define S26C3                         1017
#define LCDDATA21_SEG26               1018
#define SEG27COM3                     1019
#define S27C3                         1020
#define LCDDATA21_SEG27               1021
#define S28C3                         1022
#define SEG28COM3                     1023
#define LCDDATA21_SEG28               1024
#define SEG29COM3                     1025
#define S29C3                         1026
#define LCDDATA21_SEG29               1027
#define SEG30COM3                     1028
#define LCDDATA21_SEG30               1029
#define S30C3                         1030
#define S31C3                         1031
#define LCDDATA21_SEG31               1032
#define SEG31COM3                     1033
#define LCDDATA22                     1034
#define S32C3                         1035
#define LCDDATA22_SEG32               1036
#define SEG32COM3                     1037
#define SEG33COM3                     1038
#define LCDDATA22_SEG33               1039
#define S33C3                         1040
#define LCDDATA22_SEG34               1041
#define S34C3                         1042
#define SEG34COM3                     1043
#define LCDDATA22_SEG35               1044
#define S35C3                         1045
#define SEG35COM3                     1046
#define SEG36COM3                     1047
#define LCDDATA22_SEG36               1048
#define S36C3                         1049
#define LCDDATA22_SEG37               1050
#define S37C3                         1051
#define SEG37COM3                     1052
#define LCDDATA22_SEG38               1053
#define SEG38COM3                     1054
#define S38C3                         1055
#define LCDDATA22_SEG39               1056
#define SEG39COM3                     1057
#define S39C3                         1058
#define LCDDATA23                     1059
#define S40C3                         1060
#define LCDDATA23_SEG40               1061
#define SEG40COM3                     1062
#define SEG41COM3                     1063
#define LCDDATA23_SEG41               1064
#define S41C3                         1065
#define LCDSE3                        1066
#define LCDSE3_SEG24                  1067
#define SEGEN24                       1068
#define SE24                          1069
#define LCDSE3_SEG25                  1070
#define SEGEN25                       1071
#define SE25                          1072
#define LCDSE3_SEG26                  1073
#define SEGEN26                       1074
#define SE26                          1075
#define LCDSE3_SEG27                  1076
#define SEGEN27                       1077
#define SE27                          1078
#define SEGEN28                       1079
#define LCDSE3_SEG28                  1080
#define SE28                          1081
#define SEGEN29                       1082
#define LCDSE3_SEG29                  1083
#define SE29                          1084
#define SEGEN30                       1085
#define LCDSE3_SEG30                  1086
#define SE30                          1087
#define SEGEN31                       1088
#define LCDSE3_SEG31                  1089
#define SE31                          1090
#define LCDSE4                        1091
#define SEGEN32                       1092
#define SE32                          1093
#define LCDSE4_SEG32                  1094
#define SEGEN33                       1095
#define SE33                          1096
#define LCDSE4_SEG33                  1097
#define SEGEN34                       1098
#define SE34                          1099
#define LCDSE4_SEG34                  1100
#define SEGEN35                       1101
#define SE35                          1102
#define LCDSE4_SEG35                  1103
#define SEGEN36                       1104
#define SE36                          1105
#define LCDSE4_SEG36                  1106
#define SEGEN37                       1107
#define SE37                          1108
#define LCDSE4_SEG37                  1109
#define SE38                          1110
#define SEGEN38                       1111
#define LCDSE4_SEG38                  1112
#define SE39                          1113
#define SEGEN39                       1114
#define LCDSE4_SEG39                  1115
#define LCDSE5                        1116
#define LCDSE5_SEG40                  1117
#define SE40                          1118
#define SEGEN40                       1119
#define SE41                          1120
#define LCDSE5_SEG41                  1121
#define SEGEN41                       1122

#endif // _PIC16F946_H_
